Tekla Open API Reference for Tekla Structures 2025
Events.Interrupted Event
 Occurs when user interrupts.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.InterruptedDelegate Interrupted
Public Event Interrupted As Events.InterruptedDelegate
Value
Type: Tekla.Structures.Model.Events.InterruptedDelegate
Implements
IEvents.Interrupted
See Also
Reference
Events Class
Tekla.Structures.Model Namespace